Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20n/atdf/ATSAMC20N18A.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!-- ============================================================================ -->
<!-- Copyright (c) 2017 Atmel Corporation,                                        -->
<!--                    a wholly owned subsidiary of Microchip Technology Inc.    -->
<!-- Licensed under the Apache License, Version 2.0 (the "License");              -->
<!-- you may not use this file except in compliance with the License.             -->
<!-- You may obtain a copy of the Licence at                                      -->
<!--                                                                              -->
<!--     http://www.apache.org/licenses/LICENSE-2.0                               -->
<!--                                                                              -->
<!-- Unless required by applicable law or agreed to in writing, software          -->
<!-- distributed under the License is distributed on an "AS IS" BASIS,            -->
<!-- WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.     -->
<!-- See the License for the specific language governing permissions and          -->
<!-- limitations under the License.                                               -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="SAMC20N18A-MN" package="QFN100" pinout="SAMC21N" speedmax="48000000" tempmin="-40" tempmax="105" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="SAMC20N18A-AN" package="TQFP100" pinout="SAMC21N" speedmax="48000000" tempmin="-40" tempmax="105" vccmin="2.7" vccmax="5.5"/>
  </variants>
  <devices>
    <device name="ATSAMC20N18A" architecture="CORTEX-M0PLUS" family="SAMC" series="SAMC20">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x40000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="AUX0" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="AUX1" start="0x00806000" size="0x100" type="fuses" pagesize="64" rw="R"/>
          <memory-segment name="RWW" start="0x00400000" size="0x2000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW"/>
          <memory-segment name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW"/>
          <memory-segment name="HPB3" start="0x43000000" size="0x8000" type="io" rw="RW"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x10000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="NUM_IRQ" value="31"/>
        <param name="__CM0PLUS_REV" value="0x0001"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__NVIC_PRIO_BITS" value="2"/>
        <param name="__VTOR_PRESENT" value="1"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2245" version="1.1.1">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x42005000"/>
            <signals>
              <signal group="AIN" index="0" function="B_AC" pad="PA04"/>
              <signal group="AIN" index="1" function="B_AC" pad="PA05"/>
              <signal group="AIN" index="2" function="B_AC" pad="PA06"/>
              <signal group="AIN" index="3" function="B_AC" pad="PA07"/>
              <signal group="AIN" index="4" function="B_AC" pad="PA02"/>
              <signal group="AIN" index="5" function="B_AC" pad="PB04"/>
              <signal group="AIN" index="6" function="B_AC" pad="PB05"/>
              <signal group="AIN" index="7" function="B_AC" pad="PB06"/>
              <signal group="CMP" index="0" function="H" pad="PA12"/>
              <signal group="CMP" index="0" function="H" pad="PA18"/>
              <signal group="CMP" index="0" function="H" pad="PB24"/>
              <signal group="CMP" index="1" function="H" pad="PA13"/>
              <signal group="CMP" index="1" function="H" pad="PA19"/>
              <signal group="CMP" index="1" function="H" pad="PB25"/>
              <signal group="CMP" index="2" function="H" pad="PA00"/>
              <signal group="CMP" index="2" function="H" pad="PA24"/>
              <signal group="CMP" index="2" function="H" pad="PB30"/>
              <signal group="CMP" index="3" function="H" pad="PA01"/>
              <signal group="CMP" index="3" function="H" pad="PA25"/>
              <signal group="CMP" index="3" function="H" pad="PB31"/>
            </signals>
            <parameters>
              <param name="COMPCTRL_MUXNEG_OPAMP" value="7"/>
              <param name="GCLK_ID" value="40"/>
              <param name="NUM_CMP" value="4"/>
              <param name="PAIRS" value="2"/>
              <param name="SPEED_LEVELS" value="2"/>
              <param name="INSTANCE_ID" value="84"/>
            </parameters>
          </instance>
        </module>
