Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20n/atdf/ATSAMC20N18A.atdf
        <register name="INTENSET" offset="0x16" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="USART Interrupt Enable Set">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="RXS" caption="Receive Start Interrupt Enable" mask="0x8"/>
          <bitfield name="CTSIC" caption="Clear To Send Input Change Interrupt Enable" mask="0x10"/>
          <bitfield name="RXBRK" caption="Break Received Interrupt Enable" mask="0x20"/>
          <bitfield name="ERROR" caption="Combined Error Interrupt Enable" mask="0x80"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="USART Interrupt Flag Status and Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt" mask="0x4"/>
          <bitfield name="RXS" caption="Receive Start Interrupt" mask="0x8"/>
          <bitfield name="CTSIC" caption="Clear To Send Input Change Interrupt" mask="0x10"/>
          <bitfield name="RXBRK" caption="Break Received Interrupt" mask="0x20"/>
          <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="USART Status">
          <bitfield name="PERR" caption="Parity Error" mask="0x1"/>
          <bitfield name="FERR" caption="Frame Error" mask="0x2"/>
          <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
          <bitfield name="CTS" caption="Clear To Send" mask="0x8"/>
          <bitfield name="ISF" caption="Inconsistent Sync Field" mask="0x10"/>
          <bitfield name="COLL" caption="Collision Detected" mask="0x20"/>
          <bitfield name="TXE" caption="Transmitter Empty" mask="0x40"/>
        </register>
        <register name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="USART Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
        </register>
        <register name="DATA" offset="0x28" rw="RW" size="2" initval="0x0000" caption="USART Data">
          <bitfield name="DATA" caption="Data Value" mask="0x1FF"/>
        </register>
        <register name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="USART Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
      </register-group>
    </module>
    <module name="SUPC" id="U2117" version="2.2.0" caption="Supply Controller">
      <register-group name="SUPC" caption="Supply Controller">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
          <bitfield name="BODCORERDY" caption="BODCORE Ready" mask="0x8"/>
          <bitfield name="BODCOREDET" caption="BODCORE Detection" mask="0x10"/>
          <bitfield name="BCORESRDY" caption="BODCORE Synchronization Ready" mask="0x20"/>
          <bitfield name="VREG33RDY" caption="VREG33 Ready" mask="0x40"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
          <bitfield name="BODCORERDY" caption="BODCORE Ready" mask="0x8"/>
          <bitfield name="BODCOREDET" caption="BODCORE Detection" mask="0x10"/>
          <bitfield name="BCORESRDY" caption="BODCORE Synchronization Ready" mask="0x20"/>
          <bitfield name="VREG33RDY" caption="VREG33 Ready" mask="0x40"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
          <bitfield name="BODCORERDY" caption="BODCORE Ready" mask="0x8"/>
          <bitfield name="BODCOREDET" caption="BODCORE Detection" mask="0x10"/>
          <bitfield name="BCORESRDY" caption="BODCORE Synchronization Ready" mask="0x20"/>
          <bitfield name="VREG33RDY" caption="VREG33 Ready" mask="0x40"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
          <bitfield name="BODCORERDY" caption="BODCORE Ready" mask="0x8"/>
          <bitfield name="BODCOREDET" caption="BODCORE Detection" mask="0x10"/>
          <bitfield name="BCORESRDY" caption="BODCORE Synchronization Ready" mask="0x20"/>
          <bitfield name="VREG33RDY" caption="VREG33 Ready" mask="0x40"/>
        </register>
        <register name="BODVDD" offset="0x10" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="BODVDD Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x18" values="SUPC_BODVDD__ACTION"/>
          <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ACTCFG" caption="Configuration in Active mode" mask="0x100"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SUPC_BODVDD__PSEL"/>
          <bitfield name="LEVEL" caption="Threshold Level for VDD" mask="0x3F0000"/>
        </register>
        <register name="BODCORE" offset="0x14" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="BODCORE Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x18" values="SUPC_BODCORE__ACTION"/>
          <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ACTCFG" caption="Configuration in Active mode" mask="0x100"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SUPC_BODCORE__PSEL"/>
          <bitfield name="LEVEL" caption="Threshold Level" mask="0x3F0000"/>
        </register>
        <register name="VREG" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="VREG Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
        </register>
        <register name="VREF" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="VREF Control">
          <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x2"/>
          <bitfield name="VREFOE" caption="Voltage Reference Output Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Contrl" mask="0x80"/>
          <bitfield name="SEL" caption="Voltage Reference Selection" mask="0xF0000" values="SUPC_VREF__SEL"/>
        </register>
        <register name="VREG33" offset="0x20" rw="RW" size="4" initval="0x00000010" caption="VREG33 Control">
          <bitfield name="ENABLE" caption="VREG33 Enable" mask="0x2"/>
          <bitfield name="ENRDY" caption="VREG33 Ready Enable" mask="0x4"/>
          <bitfield name="BYPASS" caption="VREG33 Bypass" mask="0x8"/>
          <bitfield name="ISOEN" caption="Isolation Enable" mask="0x10"/>
        </register>
      </register-group>
